from stock_predict import models

def add_company():
    models.Company.objects.all().delete() #

    companies = {
    "1101": "台　泥",
    "1216": "統　一",
    "1301": "台　塑",
    "1303": "南　亞",
    "1326": "台　化",
    "1590": "亞德客-KY",
    "2002": "中　鋼",
    "2207": "和泰車",
    "2301": "光寶科",
    "2303": "聯　電",
    "2308": "台達電",
    "2317": "鴻　海",
    "2327": "國　巨",
    "2330": "台積電",
    "2345": "智　邦",
    "2352": "佳世達",
    "2357": "華　碩",
    "2379": "瑞　昱",
    "2382": "廣　達",
    "2395": "研　華",
    "2408": "南亞科",
    "2412": "中華電",
    "2454": "聯發科",
    "2603": "長　榮",
    "2610": "華　航",
    "2801": "彰　銀",
    "2880": "華南金",
    "2881": "富邦金",
    "2882": "國泰金",
    "2883": "開發金",
    "2884": "玉山金",
    "2885": "元大金",
    "2886": "兆豐金",
    "2887": "台新金",
    "2890": "永豐金",
    "2891": "中信金",
    "2892": "第一金",
    "2912": "統一超",
    "3008": "大立光",
    "3034": "聯　詠",
    "3037": "欣　興",
    "3045": "台灣大",
    "3231": "緯　創",
    "3711": "日月光投控",
    "4904": "遠　傳",
    "4938": "和　碩",
    "5871": "中租-KY",
    "5876": "上海商銀",
    "5880": "合庫金",
    "6505": "台塑化",
    "6669": "緯　穎",
    "9910": "豐　泰"
        }

    # for code,name in companies.items():
    #     company = models.Company()
    #     company.stock_code = code
    #     company.name = name
    #     company.save()

    for new_index, (code, name) in enumerate(companies.items(), start=1):
        company = models.Company()
        company.id = new_index  # 设置新的索引
        company.stock_code = code
        company.name = name
        company.save()

